In [3]:
!pip install pandas

Collecting pandas
  Obtaining dependency information for pandas from https://files.pythonhosted.org/packages/97/d8/dc2f6bff06a799a5603c414afc6de39c6351fe34892d50b6a077df3be6ac/pandas-2.1.3-cp311-cp311-win_amd64.whl.metadata
  Downloading pandas-2.1.3-cp311-cp311-win_amd64.whl.metadata (18 kB)
Collecting numpy<2,>=1.23.2 (from pandas)
  Obtaining dependency information for numpy<2,>=1.23.2 from https://files.pythonhosted.org/packages/da/3c/3ff05c2855eee52588f489a4e607e4a61699a0742aa03ccf641c77f9eb0a/numpy-1.26.2-cp311-cp311-win_amd64.whl.metadata
  Downloading numpy-1.26.2-cp311-cp311-win_amd64.whl.metadata (61 kB)
     ---------------------------------------- 0.0/61.2 kB ? eta -:--:--
     ------------------------- ------------ 41.0/61.2 kB 991.0 kB/s eta 0:00:01
     ---------------------------------------- 61.2/61.2 kB 1.1 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amitm\miniconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\amitm\miniconda3\lib\site-packages (from pandas) (2023.3.post1)
Collecting tzdata>=2022.1 (from pandas)
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ---------------------------------------- 0.0/341.8 kB ? eta -:--:--
     ------- -------------------------------- 61.4/341.8 kB ? eta -:--:--
     --------------------- ---------------- 194.6/341.8 kB 3.0 MB/s eta 0:00:01
     -------------------------------------- 341.8/341.8 kB 3.0 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\amitm\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.1.3-cp311-cp311-win_amd64.whl (10.6 MB)
   ---------------------------------------- 0.0/10.6 MB ? eta -:--:--
   - -------------------------------------- 0.3/10.6 MB 9.9 MB/s eta 0:00:02
   - -------------------------------------- 0.5/10.6 MB 6.6 MB/s eta 0:00:02
   -- ------------------------------------- 0.6/10.6 MB 6.2 MB/s eta 0:00:02
   -- ------------------------------------- 0.6/10.6 MB 6.2 MB/s eta 0:00:02
   --- ------------------------------------ 0.9/10.6 MB 4.0 MB/s eta 0:00:03
   ---- ----------------------------------- 1.1/10.6 MB 4.5 MB/s eta 0:00:03
   ---- ----------------------------------- 1.1/10.6 MB 4.5 MB/s eta 0:00:03
   ----- ---------------------------------- 1.5/10.6 MB 4.6 MB/s eta 0:00:02
   ----- ---------------------------------- 1.5/10.6 MB 4.6 MB/s eta 0:00:02
   ------- -------------------------------- 1.9/10.6 MB 4.4 MB/s eta 0:00:02
   ------- -------------------------------- 2.0/10.6 MB 4.4 MB/s eta 0:00:02
   -------- ------------------------------- 2.2/10.6 MB 4.2 MB/s eta 0:00:03
   --------- ------------------------------ 2.6/10.6 MB 4.8 MB/s eta 0:00:02
   ---------- ----------------------------- 2.8/10.6 MB 4.8 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/10.6 MB 4.6 MB/s eta 0:00:02
   ------------ --------------------------- 3.3/10.6 MB 4.8 MB/s eta 0:00:02
   ------------ --------------------------- 3.3/10.6 MB 4.8 MB/s eta 0:00:02
   -------------- ------------------------- 3.7/10.6 MB 4.8 MB/s eta 0:00:02
   --------------- ------------------------ 4.0/10.6 MB 4.9 MB/s eta 0:00:02
   --------------- ------------------------ 4.1/10.6 MB 4.9 MB/s eta 0:00:02
   --------------- ------------------------ 4.2/10.6 MB 4.6 MB/s eta 0:00:02
   ----------------- ---------------------- 4.7/10.6 MB 4.9 MB/s eta 0:00:02
   ------------------ --------------------- 4.9/10.6 MB 4.9 MB/s eta 0:00:02
   ------------------- -------------------- 5.1/10.6 MB 4.9 MB/s eta 0:00:02
   -------------------- ------------------- 5.3/10.6 MB 4.9 MB/s eta 0:00:02
   --------------------- ------------------ 5.6/10.6 MB 5.0 MB/s eta 0:00:02
   --------------------- ------------------ 5.7/10.6 MB 4.9 MB/s eta 0:00:02
   ---------------------- ----------------- 5.8/10.6 MB 4.8 MB/s eta 0:00:01
   ----------------------- ---------------- 6.3/10.6 MB 5.0 MB/s eta 0:00:01
   ------------------------ --------------- 6.4/10.6 MB 4.9 MB/s eta 0:00:01
   ------------------------ --------------- 6.5/10.6 MB 4.9 MB/s eta 0:00:01
   ------------------------- -------------- 6.8/10.6 MB 4.9 MB/s eta 0:00:01
   -------------------------- ------------- 7.1/10.6 MB 5.0 MB/s eta 0:00:01
   --------------------------- ------------ 7.2/10.6 MB 4.9 MB/s eta 0:00:01
   --------------------------- ------------ 7.3/10.6 MB 4.8 MB/s eta 0:00:01
   ----------------------------- ---------- 7.8/10.6 MB 5.1 MB/s eta 0:00:01
   ----------------------------- ---------- 7.9/10.6 MB 5.0 MB/s eta 0:00:01
   ------------------------------ --------- 8.0/10.6 MB 4.9 MB/s eta 0:00:01
   ------------------------------- -------- 8.4/10.6 MB 5.0 MB/s eta 0:00:01
   -------------------------------- ------- 8.6/10.6 MB 5.1 MB/s eta 0:00:01
   -------------------------------- ------- 8.7/10.6 MB 5.0 MB/s eta 0:00:01
   ---------------------------------- ----- 9.2/10.6 MB 5.0 MB/s eta 0:00:01
   ----------------------------------- ---- 9.3/10.6 MB 5.1 MB/s eta 0:00:01
   ----------------------------------- ---- 9.5/10.6 MB 5.0 MB/s eta 0:00:01
   ------------------------------------ --- 9.6/10.6 MB 5.0 MB/s eta 0:00:01
   ------------------------------------- -- 9.8/10.6 MB 4.9 MB/s eta 0:00:01
   -------------------------------------- - 10.3/10.6 MB 5.0 MB/s eta 0:00:01
   -------------------------------------- - 10.3/10.6 MB 5.0 MB/s eta 0:00:01
   ---------------------------------------  10.6/10.6 MB 5.0 MB/s eta 0:00:01
   ---------------------------------------- 10.6/10.6 MB 5.0 MB/s eta 0:00:00
Downloading numpy-1.26.2-cp311-cp311-win_amd64.whl (15.8 MB)
   ---------------------------------------- 0.0/15.8 MB ? eta -:--:--
   ---------------------------------------- 0.1/15.8 MB 4.3 MB/s eta 0:00:04
   - -------------------------------------- 0.4/15.8 MB 6.3 MB/s eta 0:00:03
   - -------------------------------------- 0.7/15.8 MB 6.4 MB/s eta 0:00:03
   -- ------------------------------------- 0.9/15.8 MB 5.6 MB/s eta 0:00:03
   -- ------------------------------------- 1.0/15.8 MB 5.5 MB/s eta 0:00:03
   -- ------------------------------------- 1.1/15.8 MB 4.5 MB/s eta 0:00:04
   --- ------------------------------------ 1.5/15.8 MB 5.2 MB/s eta 0:00:03
   ---- ----------------------------------- 1.7/15.8 MB 5.2 MB/s eta 0:00:03
   ---- ----------------------------------- 1.8/15.8 MB 5.1 MB/s eta 0:00:03
   ---- ----------------------------------- 2.0/15.8 MB 4.5 MB/s eta 0:00:04
   ----- ---------------------------------- 2.1/15.8 MB 4.4 MB/s eta 0:00:04
   ------ --------------------------------- 2.5/15.8 MB 4.8 MB/s eta 0:00:03
   ------ --------------------------------- 2.7/15.8 MB 4.9 MB/s eta 0:00:03
   ------- -------------------------------- 2.8/15.8 MB 4.9 MB/s eta 0:00:03
   ------- -------------------------------- 2.9/15.8 MB 4.6 MB/s eta 0:00:03
   ------- -------------------------------- 3.1/15.8 MB 4.6 MB/s eta 0:00:03
   -------- ------------------------------- 3.5/15.8 MB 4.9 MB/s eta 0:00:03
   --------- ------------------------------ 3.6/15.8 MB 4.7 MB/s eta 0:00:03
   --------- ------------------------------ 3.7/15.8 MB 4.7 MB/s eta 0:00:03
   --------- ------------------------------ 3.9/15.8 MB 4.6 MB/s eta 0:00:03
   ----------- ---------------------------- 4.5/15.8 MB 5.0 MB/s eta 0:00:03
   ----------- ---------------------------- 4.5/15.8 MB 4.8 MB/s eta 0:00:03
   ----------- ---------------------------- 4.7/15.8 MB 4.7 MB/s eta 0:00:03
   ------------ --------------------------- 4.8/15.8 MB 4.7 MB/s eta 0:00:03
   ------------- -------------------------- 5.4/15.8 MB 5.0 MB/s eta 0:00:03
   ------------- -------------------------- 5.4/15.8 MB 4.9 MB/s eta 0:00:03
   ------------- -------------------------- 5.5/15.8 MB 4.9 MB/s eta 0:00:03
   -------------- ------------------------- 5.7/15.8 MB 4.8 MB/s eta 0:00:03
   --------------- ------------------------ 6.1/15.8 MB 5.0 MB/s eta 0:00:02
   --------------- ------------------------ 6.3/15.8 MB 5.0 MB/s eta 0:00:02
   ---------------- ----------------------- 6.3/15.8 MB 4.9 MB/s eta 0:00:02
   ---------------- ----------------------- 6.5/15.8 MB 4.9 MB/s eta 0:00:02
   ----------------- ---------------------- 6.9/15.8 MB 4.9 MB/s eta 0:00:02
   ------------------ --------------------- 7.1/15.8 MB 5.0 MB/s eta 0:00:02
   ------------------ --------------------- 7.4/15.8 MB 5.0 MB/s eta 0:00:02
   ------------------ --------------------- 7.5/15.8 MB 4.9 MB/s eta 0:00:02
   ------------------- -------------------- 7.6/15.8 MB 4.8 MB/s eta 0:00:02
   ------------------- -------------------- 7.8/15.8 MB 4.9 MB/s eta 0:00:02
   -------------------- ------------------- 8.3/15.8 MB 5.0 MB/s eta 0:00:02
   --------------------- ------------------ 8.4/15.8 MB 4.9 MB/s eta 0:00:02
   --------------------- ------------------ 8.5/15.8 MB 4.9 MB/s eta 0:00:02
   --------------------- ------------------ 8.7/15.8 MB 4.8 MB/s eta 0:00:02
   ---------------------- ----------------- 9.0/15.8 MB 5.0 MB/s eta 0:00:02
   ----------------------- ---------------- 9.3/15.8 MB 5.0 MB/s eta 0:00:02
   ----------------------- ---------------- 9.3/15.8 MB 4.9 MB/s eta 0:00:02
   ----------------------- ---------------- 9.4/15.8 MB 4.9 MB/s eta 0:00:02
   ------------------------ --------------- 9.6/15.8 MB 4.8 MB/s eta 0:00:02
   ------------------------ --------------- 9.9/15.8 MB 4.9 MB/s eta 0:00:02
   -------------------------- ------------- 10.3/15.8 MB 4.9 MB/s eta 0:00:02
   -------------------------- ------------- 10.4/15.8 MB 4.9 MB/s eta 0:00:02
   -------------------------- ------------- 10.5/15.8 MB 4.9 MB/s eta 0:00:02
   -------------------------- ------------- 10.6/15.8 MB 4.9 MB/s eta 0:00:02
   --------------------------- ------------ 11.0/15.8 MB 4.9 MB/s eta 0:00:01
   ---------------------------- ----------- 11.3/15.8 MB 5.0 MB/s eta 0:00:01
   ----------------------------- ---------- 11.5/15.8 MB 4.9 MB/s eta 0:00:01
   ----------------------------- ---------- 11.6/15.8 MB 4.9 MB/s eta 0:00:01
   ------------------------------ --------- 11.9/15.8 MB 4.8 MB/s eta 0:00:01
   ------------------------------- -------- 12.3/15.8 MB 5.1 MB/s eta 0:00:01
   ------------------------------- -------- 12.4/15.8 MB 5.1 MB/s eta 0:00:01
   ------------------------------- -------- 12.6/15.8 MB 5.0 MB/s eta 0:00:01
   -------------------------------- ------- 12.8/15.8 MB 5.0 MB/s eta 0:00:01
   --------------------------------- ------ 13.3/15.8 MB 5.2 MB/s eta 0:00:01
   --------------------------------- ------ 13.3/15.8 MB 5.2 MB/s eta 0:00:01
   ---------------------------------- ----- 13.5/15.8 MB 5.1 MB/s eta 0:00:01
   ---------------------------------- ----- 13.6/15.8 MB 5.0 MB/s eta 0:00:01
   ---------------------------------- ----- 13.8/15.8 MB 5.1 MB/s eta 0:00:01
   ----------------------------------- ---- 14.2/15.8 MB 5.2 MB/s eta 0:00:01
   ------------------------------------ --- 14.5/15.8 MB 5.2 MB/s eta 0:00:01
   ------------------------------------- -- 14.6/15.8 MB 5.0 MB/s eta 0:00:01
   ------------------------------------- -- 14.7/15.8 MB 5.0 MB/s eta 0:00:01
   -------------------------------------- - 15.2/15.8 MB 5.2 MB/s eta 0:00:01
   -------------------------------------- - 15.3/15.8 MB 5.1 MB/s eta 0:00:01
   ---------------------------------------  15.6/15.8 MB 5.1 MB/s eta 0:00:01
   ---------------------------------------- 15.8/15.8 MB 5.1 MB/s eta 0:00:00
Installing collected packages: tzdata, numpy, pandas
Successfully installed numpy-1.26.2 pandas-2.1.3 tzdata-2023.3

In [6]:
import pandas as pd

In [7]:
a = (1,2,3,4,5,6)

b = ["one","two","three","four","five","six"] 

#dtype=int
x = pd.Series(data = b)
x

0      one
1      two
2    three
3     four
4     five
5      six
dtype: object

In [11]:
y = pd.Series(data = a, index=b, dtype= str)
y

one      1
two      2
three    3
four     4
five     5
six      6
dtype: object

In [13]:
z = pd.Series(data = b, index=a, dtype= str)
z

1      one
2      two
3    three
4     four
5     five
6      six
dtype: object

In [14]:
#Series from list
a = [1,2,3,4]
b = ("I","II","III","IV")
s = pd.Series(data = a, index= b ,dtype=int)
s

I      1
II     2
III    3
IV     4
dtype: int32

In [15]:
s.Index

Index(['I', 'II', 'III', 'IV'], dtype='object')

In [16]:
s['III']

3

In [19]:
data = pd.Series([1,2,3,4.6])
data

0    1.0
1    2.0
2    3.0
3    4.6
dtype: float64

In [20]:
data[::-1]

3    4.6
2    3.0
1    2.0
0    1.0
dtype: float64

In [21]:
data[-2] ## NEGATIVE INDEX DOESNT WORK HERE

KeyError: -2

In [22]:
data[2:4]

2    3.0
3    4.6
dtype: float64

In [23]:
data[2]

3.0

In [24]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
data.values

array([1. , 2. , 3. , 4.6])

In [28]:
emp={"A":8,"B":9,"C":10}

details= pd.Series(emp)

details

A     8
B     9
C    10
dtype: int64

In [29]:
#changing order of index
age = {'ram' : 28,'bob' : 19, 'cam' : 22}

s = pd.Series(data= age, index=['bob','ram','cam',"hello"],dtype=int)
s

bob      19.0
ram      28.0
cam      22.0
hello     NaN
dtype: float64

In [30]:
population_dict ={'California':38332521,
                 'Texas':26448193,
                 'New York':19651127,
                 'Florida':19562860,
                 'Florida':19662860,
                 'Illinois':12882135,
                 'Illinois':12892135}
population_series = pd.Series(population_dict)
population_series

California    38332521
Texas         26448193
New York      19651127
Florida       19662860
Illinois      12892135
dtype: int64

In [31]:
population_series['Texas':'Illinois']

Texas       26448193
New York    19651127
Florida     19662860
Illinois    12892135
dtype: int64

In [32]:
population_dict.keys()

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [33]:
population_dict.values()

dict_values([38332521, 26448193, 19651127, 19662860, 12892135])

In [34]:
population_series['New York']

19651127

In [36]:
population_series_rev = pd.Series(data = population_dict.keys() , 
                              index = population_dict.values(), dtype = str)
population_series_rev

38332521    California
26448193         Texas
19651127      New York
19662860       Florida
12892135      Illinois
dtype: object

In [37]:
pd.Series([2,3,4])

0    2
1    3
2    4
dtype: int64

In [38]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [39]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

In [40]:
pd.Series({2:'a',1:'b',3:'c'},index=[3,2])

3    c
2    a
dtype: object

In [41]:
area_dict = {'California':423967,
            'Texas':695662,
            'New York':141297,
            'Florida':170312,
            'Illinois':149995}
area_series = pd.Series(area_dict) 
area_series

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [42]:
states = pd.DataFrame({'population':population_series,
                      'area':area_series})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19662860  170312
Illinois      12892135  149995

In [43]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [44]:
states.values

array([[38332521,   423967],
       [26448193,   695662],
       [19651127,   141297],
       [19662860,   170312],
       [12892135,   149995]], dtype=int64)

In [45]:
states.columns

Index(['population', 'area'], dtype='object')

In [46]:
states['area'] ## in order to read column from a dataset use square bracket along with column name in single quotes

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [47]:
l= ["ashi","rom","sid"]

df=pd.DataFrame(l)
df

      0
0  ashi
1   rom
2   sid

In [48]:
#2D lIST

data = [['Nokia',10000],['Asus',12000],['Samsung',13000],['Apple',33000]]

d = pd.DataFrame(data,columns=['Mobile','Price'],index=[1,2,3,4])
d

    Mobile  Price
1    Nokia  10000
2     Asus  12000
3  Samsung  13000
4    Apple  33000

In [49]:
pd.DataFrame(population_series, columns = ['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19662860
Illinois      12892135

In [50]:
population_series

California    38332521
Texas         26448193
New York      19651127
Florida       19662860
Illinois      12892135
dtype: int64

In [51]:
data = [{'a':i,'b':2 * i} for i in range(5)]

pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4
3  3  6
4  4  8

In [52]:
pd.DataFrame([{'a':1,'b':2},{'b':'Ankita','c':4},{'c':'Ankur','d':2}])

     a       b      c    d
0  1.0       2    NaN  NaN
1  NaN  Ankita      4  NaN
2  NaN     NaN  Ankur  2.0

In [53]:
pd.DataFrame({'population':population_series,
                      'area':area_series})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19662860  170312
Illinois      12892135  149995

In [54]:
data = [["A",34,23,56],["B",92,88,76],["C",76," ",25],["D"," ",78,99]]

stu = pd.DataFrame(data, columns=["Name",'Maths','Phy','Chem'],index=[1,2,3,4], dtype=int)
stu

ValueError: invalid literal for int() with base 10: 'A'

In [55]:
data = [["A",34,23,56],["B",92,88,76],["C",76," ",25],["D"," ",78,99]]

stu = pd.DataFrame(data, columns=["Name",'Maths','Phy','Chem'],index=[1,2,3,4])
stu

  Name Maths Phy  Chem
1    A    34  23    56
2    B    92  88    76
3    C    76        25
4    D        78    99

In [56]:
stu["Name"]

1    A
2    B
3    C
4    D
Name: Name, dtype: object

In [57]:
stu["Phy"]

1    23
2    88
3
4    78
Name: Phy, dtype: object

In [58]:
stu.replace(" ",0)

  Name  Maths  Phy  Chem
1    A     34   23    56
2    B     92   88    76
3    C     76    0    25
4    D      0   78    99

In [62]:
# Selecting Columns
d = {'Chem' : pd.Series([30, 70, 35,25,26,67,77,67,89], index=["Raj",'Ram', 'Asa', 'Pi','Chi','Ru',"Sita","Ria","Gita"],dtype=int),
     'Math' : pd.Series([18, 26, 35, 40,55,89,79,100], index=["Raj",'Ram', 'Pi', 'Chi', 'Ru',"Sita","Ria","Gita"],dtype=int),
     'Phy' : pd.Series([31, 42, 83,34,80,78], index=["Asa",'Ram', 'Pi', 'Ru',"Sita","Gita"],dtype=int)}



exam = pd.DataFrame(d)
exam1=exam.copy() ## To make copy of your data
exam1

      Chem   Math   Phy
Asa     35    NaN  31.0
Chi     26   40.0   NaN
Gita    89  100.0  78.0
Pi      25   35.0  83.0
Raj     30   18.0   NaN
Ram     70   26.0  42.0
Ria     67   79.0   NaN
Ru      67   55.0  34.0
Sita    77   89.0  80.0

In [63]:
exam1

      Chem   Math   Phy
Asa     35    NaN  31.0
Chi     26   40.0   NaN
Gita    89  100.0  78.0
Pi      25   35.0  83.0
Raj     30   18.0   NaN
Ram     70   26.0  42.0
Ria     67   79.0   NaN
Ru      67   55.0  34.0
Sita    77   89.0  80.0

In [64]:
print ("Adding a new column using the existing columns in DataFrame:")
exam1['Total']= exam1['Chem']+exam1['Math']+exam1['Phy']
exam1

Adding a new column using the existing columns in DataFrame:

      Chem   Math   Phy  Total
Asa     35    NaN  31.0    NaN
Chi     26   40.0   NaN    NaN
Gita    89  100.0  78.0  267.0
Pi      25   35.0  83.0  143.0
Raj     30   18.0   NaN    NaN
Ram     70   26.0  42.0  138.0
Ria     67   79.0   NaN    NaN
Ru      67   55.0  34.0  156.0
Sita    77   89.0  80.0  246.0

In [67]:
exam1.isnull().sum()

Chem     0
Math     1
Phy      3
Total    4
dtype: int64

In [70]:
exam1.fillna(0)

      Chem   Math   Phy  Total
Asa     35    0.0  31.0    0.0
Chi     26   40.0   0.0    0.0
Gita    89  100.0  78.0  267.0
Pi      25   35.0  83.0  143.0
Raj     30   18.0   0.0    0.0
Ram     70   26.0  42.0  138.0
Ria     67   79.0   0.0    0.0
Ru      67   55.0  34.0  156.0
Sita    77   89.0  80.0  246.0

In [72]:
exam1["Avg"] = (exam1["Math"] + exam1["Phy"] + exam1["Chem"])/3
exam1

      Chem   Math   Phy  Total        Avg
Asa     35    NaN  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [73]:
exam1

      Chem   Math   Phy  Total        Avg
Asa     35    NaN  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

median(1,2,3)
mode(1,2,2,3,4,): Categorical data
median,mean(Con): median(Is not afftected by outliers)
1,1,2,3,4,5,67,89,8,9
1,1,2,3,4,5,8,9,67,89

In [82]:
a = exam1["Math"].median()
a
exam1["Math"] = exam1["Math"].fillna(a)

In [83]:
b=exam1["Phy"].median()
b
exam1["Phy"] = exam1["Phy"].fillna(b)

exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Asa     35   47.5  31.0    NaN        NaN            NaN
Chi     26   40.0  60.0    NaN        NaN          126.0
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Raj     30   18.0  60.0    NaN        NaN          108.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ria     67   79.0  60.0    NaN        NaN          206.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [84]:
exam1["Total_Cleaned"] = exam1["Math"]+exam1["Phy"]+exam1["Chem"]
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Asa     35   47.5  31.0    NaN        NaN          113.5
Chi     26   40.0  60.0    NaN        NaN          126.0
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Raj     30   18.0  60.0    NaN        NaN          108.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ria     67   79.0  60.0    NaN        NaN          206.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [85]:
exam1
exam1=exam1.dropna()

In [86]:
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [91]:
exam1.drop(["Total"], axis = 1 )

      Chem   Math   Phy        Avg  Total_Cleaned
Gita    89  100.0  78.0  89.000000          267.0
Pi      25   35.0  83.0  47.666667          143.0
Ram     70   26.0  42.0  46.000000          138.0
Ru      67   55.0  34.0  52.000000          156.0
Sita    77   89.0  80.0  82.000000          246.0

In [92]:
exam1.drop(["Avg"], axis = 1 )

      Chem   Math   Phy  Total  Total_Cleaned
Gita    89  100.0  78.0  267.0          267.0
Pi      25   35.0  83.0  143.0          143.0
Ram     70   26.0  42.0  138.0          138.0
Ru      67   55.0  34.0  156.0          156.0
Sita    77   89.0  80.0  246.0          246.0

In [93]:
df = pd.DataFrame({'one':[10,20,30,40,50,"ABC"], 'AGE':[-19,1,30,40,50,60]})
df

   one  AGE
0   10  -19
1   20    1
2   30   30
3   40   40
4   50   50
5  ABC   60

In [94]:
df_cleaned = df.replace({"ABC":60,-19:19})
df_cleaned

   one  AGE
0   10   19
1   20    1
2   30   30
3   40   40
4   50   50
5   60   60

In [95]:
details = {'Brand':pd.Series(['Nokia','Asus',"Nokia","Nokia",'Samsung',"ABC",'Micromax','Apple','MI','Zen',"Apple"]),
   'Price':pd.Series([10000,8000,12500,7000,40000,12000,12999,13999,59999]),
   'Rating(10)':pd.Series([7,6.5,8.5,9,8,9.5,7,9])
}

d = pd.DataFrame(details)
d

       Brand    Price  Rating(10)
0      Nokia  10000.0         7.0
1       Asus   8000.0         6.5
2      Nokia  12500.0         8.5
3      Nokia   7000.0         9.0
4    Samsung  40000.0         8.0
5        ABC  12000.0         9.5
6   Micromax  12999.0         7.0
7      Apple  13999.0         9.0
8         MI  59999.0         NaN
9        Zen      NaN         NaN
10     Apple      NaN         NaN

In [96]:
d.mean()

TypeError: Could not convert ['NokiaAsusNokiaNokiaSamsungABCMicromaxAppleMIZenApple'] to numeric

In [97]:
d["Price"].mean()

19610.777777777777

In [98]:
d["Rating(10)"].mean()

8.0625

In [99]:
d.describe()

              Price  Rating(10)
count      9.000000    8.000000
mean   19610.777778    8.062500
std    18086.018625    1.116036
min     7000.000000    6.500000
25%    10000.000000    7.000000
50%    12500.000000    8.250000
75%    13999.000000    9.000000
max    59999.000000    9.500000